configuration/src/BusinessProcesses/Job/Job.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>Job</name>
  <basedOn>Catalog.Files</basedOn>
  <basedOn>Catalog.Users</basedOn>
  <basedOn>Task.PerformerTask</basedOn>
  <task>Task.PerformerTask</task>
  <attributes>
    <name>Author</name>
    <type>
      <types>CatalogRef.ExternalUsers</types>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Importance</name>
    <comment>The importance of the Perform action point tasks for the performer</comment>
    <type>
      <types>EnumRef.TaskImportanceOptions</types>
    </type>
  </attributes>
  <attributes>
    <name>Completed2</name>
    <comment>The result of completing the task after the business process is completed.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>MainTask</name>
    <type>
      <types>TaskRef.PerformerTask</types>
    </type>
  </attributes>
  <attributes>
    <name>CompletedOn</name>
    <comment>Actual date of completion of the business process</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Performer</name>
    <type>
      <types>CatalogRef.ExternalUsers</types>
      <types>CatalogRef.PerformerRoles</types>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Description</name>
    <comment>APK:58 - Task description</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>OnValidation</name>
    <comment>Indicates that the task verifier is specified</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IterationNumber</name>
    <comment>Number of business process cycles between the executor and the reviewer</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Accepted</name>
    <comment>Internal state of the business process</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SubjectOf</name>
    <comment>The system object that the business process was created for.</comment>
    <type>
      <types>DefinedType.TaskSubject</types>
    </type>
  </attributes>
  <attributes>
    <name>Supervisor</name>
    <type>
      <types>CatalogRef.ExternalUsers</types>
      <types>CatalogRef.PerformerRoles</types>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>ExecutionResult</name>
    <comment>History of correspondence between the performer and the reviewer</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Content</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>State</name>
    <type>
      <types>EnumRef.BusinessProcessStates</types>
    </type>
  </attributes>
  <attributes>
    <name>TaskDueDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>VerificationDueDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>AuthorAsString</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExternalJob</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SourceTask</name>
    <type>
      <types>TaskRef.PerformerTask</types>
    </type>
  </attributes>
  <attributes>
    <name>SubjectContent</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>MainAddressingObject</name>
    <type>
      <types>Characteristic.TaskAddressingObjects</types>
    </type>
  </attributes>
  <attributes>
    <name>MainAddressingObjectSupervisor</name>
    <type>
      <types>Characteristic.TaskAddressingObjects</types>
    </type>
  </attributes>
  <attributes>
    <name>AdditionalAddressingObject</name>
    <type>
      <types>Characteristic.TaskAddressingObjects</types>
    </type>
  </attributes>
  <attributes>
    <name>AdditionalAddressingObjectSupervisor</name>
    <type>
      <types>Characteristic.TaskAddressingObjects</types>
    </type>
  </attributes>
  <attributes>
    <name>TaskPerformersGroup</name>
    <type>
      <types>CatalogRef.ExternalUsers</types>
      <types>CatalogRef.Users</types>
      <types>CatalogRef.TaskPerformersGroups</types>
    </type>
  </attributes>
  <attributes>
    <name>TaskPerformersGroupSupervisor</name>
    <type>
      <types>CatalogRef.ExternalUsers</types>
      <types>CatalogRef.Users</types>
      <types>CatalogRef.TaskPerformersGroups</types>
    </type>
  </attributes>
</mdclass:BusinessProcess>

configuration/src/Enums/BusinessProcessStates/BusinessProcessStates.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>BusinessProcessStates</name>
  <enumValues>
    <name>Running</name>
  </enumValues>
  <enumValues>
    <name>Suspended</name>
  </enumValues>
</mdclass:Enum>

configuration/src/Catalogs/Users/Users.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Users</name>
  <comment>APK:413 - # 744.2.1.1 it is Acceptable not to disable the selection history, since it is used, and the selection redefinition is fixed, that is, service and invalid users will not get into it, but if they somehow got into it, this is not a problem</comment>
  <attributes>
    <name>Invalid</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Department</name>
    <type>
      <types>DefinedType.Department</types>
    </type>
  </attributes>
  <attributes>
    <name>Individual</name>
    <type>
      <types>DefinedType.Individual</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>IsInternal</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Prepared</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IBUserID</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ServiceUserID</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>DeleteInfobaseUserProperties</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Photo</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ContactInformation</name>
    <attributes>
      <name>Type</name>
      <type>
        <types>EnumRef.ContactInformationTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>Kind</name>
      <type>
        <types>CatalogRef.ContactInformationKinds</types>
      </type>
    </attributes>
    <attributes>
      <name>Presentation</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>FieldValues</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Country</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>State</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>City</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EMAddress</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ServerDomainName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PhoneNumber</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PhoneNumberWithoutCodes</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>KindForList</name>
      <type>
        <types>CatalogRef.ContactInformationKinds</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/BusinessProcesses/Job/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Public

#Region ForCallsFromOtherSubsystems

// StandardSubsystems.AccessManagement

// Parameters:
//   Table - See AccessManagement.AccessValuesSetsTable
//
Procedure FillAccessValuesSets(Table) Export

	BusinessProcessesAndTasksOverridable.OnFillingAccessValuesSets(ThisObject, Table);

	If Table.Count() > 0 Then
		Return;
	EndIf;

	FillDefaultAccessValuesSets(Table);

EndProcedure

// End StandardSubsystems.AccessManagement

#EndRegion

#EndRegion

#Region EventsHandlers

////////////////////////////////////////////////////////////////////////////////
// Business process event handlers.

Procedure BeforeWrite(Cancel)

	If DataExchange.Load Then
		Return;
	EndIf;

	If Author <> Undefined And Not Author.IsEmpty() Then
		AuthorAsString = String(Author);
	EndIf;

	BusinessProcessesAndTasksServer.ValidateRightsToChangeBusinessProcessState(ThisObject);

	If ValueIsFilled(MainTask) 
		And Common.ObjectAttributeValue(MainTask, "BusinessProcess") = Ref Then

		Raise NStr("en = 'A task that belongs to the duty cannot be specified as the main task.';");

	EndIf;

	SetPrivilegedMode(True);
	TaskPerformersGroup = ?(TypeOf(Performer) = Type("CatalogRef.PerformerRoles"),
		BusinessProcessesAndTasksServer.TaskPerformersGroup(Performer, MainAddressingObject,
			AdditionalAddressingObject), Performer);
	TaskPerformersGroupSupervisor = ?(TypeOf(Supervisor) = Type("CatalogRef.PerformerRoles"),
		BusinessProcessesAndTasksServer.TaskPerformersGroup(Supervisor, MainAddressingObjectSupervisor,
			AdditionalAddressingObjectSupervisor), Supervisor);
	SetPrivilegedMode(False);

	If Not IsNew() And Common.ObjectAttributeValue(Ref, "SubjectOf") <> SubjectOf Then
		ChangeTaskSubject();
	EndIf;

EndProcedure

Procedure Filling(FillingData, FillingText, StandardProcessing)

	If IsNew() Then
		Author = Users.AuthorizedUser();
		Supervisor = Users.AuthorizedUser();
		If TypeOf(FillingData) = Type("CatalogRef.Users") Then
			Performer = FillingData;
		Else
			// 
			Performer = Catalogs.Users.EmptyRef();
		EndIf;
	EndIf;

	If FillingData <> Undefined And TypeOf(FillingData) <> Type("Structure") 
		And FillingData <> Tasks.PerformerTask.EmptyRef() Then

		If TypeOf(FillingData) <> Type("TaskRef.PerformerTask") Then
			SubjectOf = FillingData;
		Else
			SubjectOf = FillingData.SubjectOf;
		EndIf;

	EndIf;

	BusinessProcessesAndTasksServer.FillMainTask(ThisObject, FillingData);

EndProcedure

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	NotCheckedAttributeArray = New Array;
	If Not OnValidation Then
		NotCheckedAttributeArray.Add("Supervisor");
	EndIf;
	Common.DeleteNotCheckedAttributesFromArray(CheckedAttributes, NotCheckedAttributeArray);
EndProcedure

Procedure OnCopy(CopiedObject)

	IterationNumber = 0;
	Completed2 = False;
	Accepted = False;
	ExecutionResult = "";
	CompletedOn = '00010101000000';
	State = Enums.BusinessProcessStates.Running;

EndProcedure

////////////////////////////////////////////////////////////////////////////////
// Flowchart items event handlers.

// Parameters:
//   BusinessProcessRoutePoint - BusinessProcessRoutePointRef.Job
//   TasksBeingFormed - Array of TaskObject
//   Cancel - Boolean
// 
Procedure ExecuteWhenCreatingTasks(BusinessProcessRoutePoint, TasksBeingFormed, Cancel)

	IterationNumber = IterationNumber + 1;
	Write();
	
	// Setting the addressing attributes and additional attributes for each task.
	For Each Task In TasksBeingFormed Do

		Task.Author = Author;
		Task.AuthorAsString = String(Author);
		If TypeOf(Performer) = Type("CatalogRef.PerformerRoles") Then
			Task.PerformerRole = Performer;
			Task.MainAddressingObject = MainAddressingObject;
			Task.AdditionalAddressingObject = AdditionalAddressingObject;
			Task.Performer = Undefined;
		Else
			Task.Performer = Performer;
		EndIf;
		Task.Description = TaskDescriptionForExecution();
		Task.TaskDueDate = TaskDueDateForExecution();
		Task.Importance = Importance;
		Task.SubjectOf = SubjectOf;

	EndDo;

EndProcedure

Procedure ExecuteBeforeCreatingTasks(BusinessProcessRoutePoint, TasksBeingFormed, StandardProcessing)

	If SubjectOf = Undefined Or SubjectOf.IsEmpty() Then
		Return;
	EndIf;

EndProcedure

Procedure ExecuteWhenExecuted(BusinessProcessRoutePoint, Task, Cancel)

	ExecutionResult = CompletePointExecutionResult(Task) + ExecutionResult;
	Write();

EndProcedure
// Parameters:
//  BusinessProcessRoutePoint - BusinessProcessRoutePointRef.Job
//  TasksBeingFormed - Array of TaskObject
//  Cancel - Boolean
// 
Procedure CheckWhenCreatingTasks(BusinessProcessRoutePoint, TasksBeingFormed, Cancel)

	If Supervisor.IsEmpty() Then
		Cancel = True;
		Return;
	EndIf;
	
	// Setting the addressing attributes and additional attributes for each task.
	For Each Task In TasksBeingFormed Do

		Task.Author = Author;
		If TypeOf(Supervisor) = Type("CatalogRef.PerformerRoles") Then
			Task.PerformerRole = Supervisor;
			Task.MainAddressingObject = MainAddressingObjectSupervisor;
			Task.AdditionalAddressingObject = AdditionalAddressingObjectSupervisor;
		Else
			Task.Performer = Supervisor;
		EndIf;

		Task.Description = TaskDescriptionForCheck();
		Task.TaskDueDate = TaskDueDateForCheck();
		Task.Importance = Importance;
		Task.SubjectOf = SubjectOf;

	EndDo;

EndProcedure

Procedure CheckWhenExecuting(BusinessProcessRoutePoint, Task, Cancel)

	ExecutionResult = ValidatePointExecutionResult(Task) + ExecutionResult;
	Write();

EndProcedure

Procedure NeedVerificationConditionVerification(BusinessProcessRoutePoint, Result)

	Result = OnValidation;

EndProcedure

Procedure ReturnFollowingConditionsToExecutor(BusinessProcessRoutePoint, Result)

	Result = Not Accepted;

EndProcedure

Procedure CompletionAtCompletion(BusinessProcessRoutePoint, Cancel)

	CompletedOn = BusinessProcessesAndTasksServer.BusinessProcessCompletionDate(Ref);
	Write();

EndProcedure

#EndRegion

#Region Private

// Updates attribute values of uncompleted tasks 
// according to the Job business process attributes:
//   Importance, TaskDueDate, Description, and Author.
//
Procedure ChangeUncompletedTasksAttributes() Export

	BeginTransaction();
	Try
		Block = New DataLock;
		LockItem = Block.Add("Task.PerformerTask");
		LockItem.SetValue("BusinessProcess", Ref);
		Block.Lock();

		Query = New Query("SELECT
							  |	Tasks.Ref AS Ref
							  |FROM
							  |	Task.PerformerTask AS Tasks
							  |WHERE
							  |	Tasks.BusinessProcess = &BusinessProcess
							  |	AND Tasks.DeletionMark = FALSE
							  |	AND Tasks.Executed = FALSE");
		Query.SetParameter("BusinessProcess", Ref);
		SelectionDetailRecords = Query.Execute().Select();

		While SelectionDetailRecords.Next() Do
			TaskObject = SelectionDetailRecords.Ref.GetObject(); // TaskObject
			TaskObject.Importance = Importance;
			TaskObject.TaskDueDate = ?(TaskObject.RoutePoint = BusinessProcesses.Job.RoutePoints.Execute,
				TaskDueDateForExecution(), TaskDueDateForCheck());
			TaskObject.Description = ?(TaskObject.RoutePoint = BusinessProcesses.Job.RoutePoints.Execute,
				TaskDescriptionForExecution(), TaskDescriptionForCheck());
			TaskObject.Author = Author;
			// 
			// 
			TaskObject.Write();
		EndDo;

		CommitTransaction();
	Except
		RollbackTransaction();
		Raise;
	EndTry;

EndProcedure

Procedure ChangeTaskSubject()

	SetPrivilegedMode(True);
	BeginTransaction();
	Try
		Block = New DataLock;
		LockItem = Block.Add("Task.PerformerTask");
		LockItem.SetValue("BusinessProcess", Ref);
		Block.Lock();

		Query = New Query("SELECT
							  |	Tasks.Ref AS Ref
							  |FROM
							  |	Task.PerformerTask AS Tasks
							  |WHERE
							  |	Tasks.BusinessProcess = &BusinessProcess");

		Query.SetParameter("BusinessProcess", Ref);
		SelectionDetailRecords = Query.Execute().Select();

		While SelectionDetailRecords.Next() Do
			TaskObject = SelectionDetailRecords.Ref.GetObject(); // TaskObject
			TaskObject.SubjectOf = SubjectOf;
			// 
			// 
			TaskObject.Write();
		EndDo;
		CommitTransaction();
	Except
		RollbackTransaction();
		Raise;
	EndTry;

EndProcedure

Function TaskDescriptionForExecution()

	Return Description;

EndFunction

Function TaskDueDateForExecution()

	Return TaskDueDate;

EndFunction

Function TaskDescriptionForCheck()

	TaskDescription = NStr("en = 'Check';");
	Return ?(IsBlankString(TaskDescription), "", TaskDescription + ": ") + Description;

EndFunction

Function TaskDueDateForCheck()

	Return VerificationDueDate;

EndFunction

Function CompletePointExecutionResult(Val TaskRef)

	TaskData = Common.ObjectAttributesValues(TaskRef,
		"ExecutionResult,CompletionDate,Performer,Executed");

	StringFormat = ?(TaskData.Executed, 
		NStr("en = '%1, %2 completed the task:
			|%3';") + Chars.LF, 
		NStr("en = '%1, %2 rejected the task:
			|%3';") + Chars.LF);

	Comment = TrimAll(TaskData.ExecutionResult);
	Comment = ?(IsBlankString(Comment), "", Comment + Chars.LF);

	Result = StringFunctionsClientServer.SubstituteParametersToString(StringFormat, TaskData.CompletionDate,
		TaskData.Performer, Comment);
	Return Result;

EndFunction

Function ValidatePointExecutionResult(Val TaskRef)

	If Not Accepted Then
		StringFormat = NStr("en = '%1, %2 sent the task back for revision:
							|%3';") + Chars.LF;

	Else
		StringFormat = ?(Completed2, 
			NStr("en = '%1, %2 confirmed task completion:
				|%3';") + Chars.LF, 
			NStr("en = '%1, %2 confirmed task cancellation:
			   |%3';") + Chars.LF);
	EndIf;

	TaskData = Common.ObjectAttributesValues(TaskRef,
		"ExecutionResult,CompletionDate,Performer");
	Comment = TrimAll(TaskData.ExecutionResult);
	Comment = ?(IsBlankString(Comment), "", Comment + Chars.LF);
	Result = StringFunctionsClientServer.SubstituteParametersToString(StringFormat, TaskData.CompletionDate,
		TaskData.Performer, Comment);
	Return Result;

EndFunction

Procedure FillDefaultAccessValuesSets(Table)
	
	// 
	// 
	// 
	
	// If the subject is not specified (the business process is not based on another subject), then the subject is not involved in the restriction logic.
	
	// Reading, Changing: set No.1.
	String = Table.Add();
	String.SetNumber     = 1;
	String.Read          = True;
	String.Update       = True;
	String.AccessValue = Author;
	
	// 
	String = Table.Add();
	String.SetNumber     = 2;
	String.Read          = True;
	String.AccessValue = TaskPerformersGroup;
	
	// 
	String = Table.Add();
	String.SetNumber     = 3;
	String.Read          = True;
	String.AccessValue = TaskPerformersGroupSupervisor;

EndProcedure

#EndRegion

#Else
	Raise NStr("en = 'Invalid object call on the client.';");
#EndIf
